EDT/УТ/src/Documents/НаборнаяВедомостьВозвратаПриложенныхДокументов/НаборнаяВедомостьВозвратаПриложенныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НаборнаяВедомостьВозвратаПриложенныхДокументов</name>
  <registerRecords>InformationRegister.СтатусыДвиженияПриложенныхДокументов</registerRecords>
  <attributes>
    <name>ТерминалОбработки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ТерминалДоставки</name>
      <type>
        <types>CatalogRef.РегиональныеТерминалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПриложенногоДокумента</name>
      <type>
        <types>CatalogRef.ВидыПриложенныхДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПринятКассиром</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДнейВозврата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПодтвержденКСборке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗаказа</name>
      <type>
        <types>CatalogRef.СтатусЗаказаИнтернетМагазина</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/ЭтапыВозвратаСопроводительныхДокументов/ЭтапыВозвратаСопроводительныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭтапыВозвратаСопроводительныхДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусСкладскогоУчета</name>
    <type>
      <types>CatalogRef.СтатусыСкладскогоУчета</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВозвратСопроводительныхДокументов</name>
    <type>
      <types>DocumentRef.НаборнаяВедомостьВозвратаПриложенныхДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыЗаказа/ДополнительныеПараметрыЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыЗаказа</name>
  <resources>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОплатеКлиентом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкладМагазина</name>
    <type>
      <types>CatalogRef.СкладыМагазинов</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтклоненияЗаказа</name>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </resources>
  <resources>
    <name>ЧастичныйВыкупЗапрещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СОжиданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КОплатеКлиентомИзмененное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>okey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШтрихкодOZON</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>nameOZON</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВозвратЗапрещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодъемОплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РасстояниеОтБазыПоДорогам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КатегорияДляРасчетаЗП</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
    </type>
  </resources>
  <resources>
    <name>ПравилоСопоставленияКатегории</name>
    <type>
      <types>CatalogRef.ПравилаСопоставленияКатегорийЗаказовДляРасчетаЗП</types>
    </type>
  </resources>
  <resources>
    <name>ПредварительноеЗакрытие</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныйНомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДСФЗПоДоставке</name>
    <type>
      <types>CatalogRef.СтавкиНДСФЗ54</types>
    </type>
  </resources>
  <resources>
    <name>EmailКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МетодОплатыПодъемаЗаказа</name>
    <type>
      <types>EnumRef.МетодыОплатыПодъёмаЗаказа</types>
    </type>
  </resources>
  <resources>
    <name>ТарифнаяСеткаПодъемаЗаказов</name>
    <type>
      <types>CatalogRef.ТарифыПодъемаЗаказовНаЭтаж</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияДляРасчетаЗП_Миго</name>
    <type>
      <types>CatalogRef.мгКатегорииЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>СхемаЛогистическихБрейков</name>
    <type>
      <types>CatalogRef.СхемыЛогистическихБрейков</types>
    </type>
  </resources>
  <resources>
    <name>ЛогистическийБрейк</name>
    <type>
      <types>CatalogRef.ЛогистическиеБрейки</types>
    </type>
  </resources>
  <resources>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </resources>
  <resources>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </resources>
  <resources>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодИдентификацииКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолучательЗаказа</name>
    <type>
      <types>CatalogRef.ПолучателиЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяПредъявлениеУдостоверяющегоДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифРасчетаСтоимостиДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НегабаритныйЗаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодписаниеИВозвратСопрДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Агрегатор</name>
    <type>
      <types>CatalogRef.Маркетплейсы</types>
    </type>
  </resources>
  <resources>
    <name>ТарификацияПоОбъемномуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПунктПВЗ</name>
    <type>
      <types>CatalogRef.ПунктыПВЗ</types>
    </type>
  </resources>
  <resources>
    <name>УровеньОбслуживанияЗаказа</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>СсылкаНаОтслеживание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСозданияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ГабаритнаяХарактеристикаОпределенияЛогБрейка</name>
    <type>
      <types>EnumRef.ГабаритныеХарактеристикиЗаказа</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/СтатусыЗаказов/СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаказов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>СтатусAxiomus</name>
    <type>
      <types>CatalogRef.СтатусыAxiomus</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредварительноеЗакрытие</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инициатор</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/СтатусыДвиженияПриложенныхДокументов/СтатусыДвиженияПриложенныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыДвиженияПриложенныхДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыДвиженияПриложенныхДокументов</types>
    </type>
  </resources>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПриложенногоДокумента</name>
    <type>
      <types>CatalogRef.ВидыПриложенныхДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/СтатусыДвиженияПриложенныхДокументов/СтатусыДвиженияПриложенныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыДвиженияПриложенныхДокументов</name>
  <predefined>
    <items>
      <name>ДокументыВозвращеныВТК</name>
      <description>Документы возвращены в ТК</description>
    </items>
    <items>
      <name>ДокументыВозвращеныПартнеру</name>
      <description>Документы возвращены партнеру</description>
    </items>
    <items>
      <name>ДокументыНеВозвращеныВТК</name>
      <description>Документы не возвращены в ТК</description>
    </items>
    <items>
      <name>ДокументыПоступилиВТКОтПартнера</name>
      <description>Документы поступили в ТК от партнера</description>
    </items>
    <items>
      <name>ДокументыТребуютПереподписания</name>
      <description>Документы требуют переподписания</description>
    </items>
  </predefined>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/ВидыПриложенныхДокументов/ВидыПриложенныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыПриложенныхДокументов</name>
  <predefined>
    <items>
      <name>БезналичныеДокументы</name>
      <description>Безналичные документы</description>
    </items>
    <items>
      <name>СопроводительныеДокументы</name>
      <description>Сопроводительные документы</description>
    </items>
  </predefined>
</mdclass:Catalog>

EDT/УТ/src/Documents/НаборнаяВедомостьВозвратаПриложенныхДокументов/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Не Источник = "Сканер штрихкода" Тогда
		Возврат;
	КонецЕсли;		
  
	Если НЕ ЗначениеЗаполнено(Данные) Тогда
		Возврат;
	КонецЕсли;	
	
	СканироватьШКНаСервере(Данные);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		Если Объект.Партнер.Пустая() Тогда
			Сообщить("Создание документы без указания партнера запрещено");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Если Объект.ТерминалОбработки.Пустая() Тогда
			Сообщить("Создание документы без указания терминала обработки запрещено");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Объект.Дата = ТекущаяДата();
		ЗаполнитьЗаказы();
		Элементы.ЭтапОбработки.Видимость = Ложь;
	Иначе
		ПроверитьЭтапОбработки();
	КонецЕсли;
	
	ЗаполнитьТаблицуСканирования();
	
	ЭтоТестоваяСреда = ПараметрыСеанса.ЭтоТестоваяСреда;
	Если Не ЭтоТестоваяСреда Тогда
		Элементы.СканироватьШК.Видимость = Ложь;
	КонецЕсли;
	
	Если РольДоступна("Админы") Тогда
	Иначе
		ИмяТекущегоПользователя = СокрЛП(ПараметрыСеанса.ТекущийПользователь.Код);
		Если ИмяТекущегоПользователя = "Щербинкин Дмитрий" Тогда
		Иначе
			Элементы.ЗаказыВыделитьВсеЗаказы.Доступность = Ложь;
			Элементы.ЗаказыСнятьВыделениеЗаказов.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЭтапОбработки()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭтапыВозвратаСопроводительныхДокументовСрезПоследних.СтатусСкладскогоУчета КАК ЭтапОбработки
	|ИЗ
	|	РегистрСведений.ЭтапыВозвратаСопроводительныхДокументов.СрезПоследних(, ВозвратСопроводительныхДокументов = &Ссылка) КАК ЭтапыВозвратаСопроводительныхДокументовСрезПоследних";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Элементы.ЭтапОбработки.Видимость = Ложь;
	Иначе
		ТолькоПросмотр = Истина;
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		ЭтапОбработки = Выборка.ЭтапОбработки;
		Элементы.ЭтапОбработки.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказы()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ДобавитьМесяц(НачалоДня(ТекущаяДата()), -6));
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ТерминалДоставки", Объект.ТерминалОбработки);
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Заказ КАК Заказ,
	|	МАКСИМУМ(ВложенныйЗапрос.СопроводительныеДокументы) КАК СопроводительныеДокументы,
	|	МАКСИМУМ(ВложенныйЗапрос.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеализацияТоваровУслуг.Ссылка КАК Заказ,
	|		ИСТИНА КАК СопроводительныеДокументы,
	|		СтатусыЗаказов.Период КАК Период
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	|			ПО (РеализацияТоваровУслуг.Дата >= &Период)
	|				И (РеализацияТоваровУслуг.ВладелецТовара = &Партнер)
	|				И (РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки)
	|				И РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ
	|				И (ДополнительныеПараметрыЗаказа.ПодписаниеИВозвратСопрДокументов)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
	|			ПО РеализацияТоваровУслуг.Ссылка = СтатусыЗаказов.Заказ
	|				И (СтатусыЗаказов.Статус В (301, 302))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДвиженияПриложенныхДокументов КАК СтатусыДвиженияПриложенныхДокументов
	|			ПО РеализацияТоваровУслуг.Ссылка = СтатусыДвиженияПриложенныхДокументов.Заказ
	|				И (СтатусыДвиженияПриложенныхДокументов.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыДвиженияПриложенныхДокументов.ДокументыВозвращеныПартнеру))
	|	ГДЕ
	|		СтатусыДвиженияПриложенныхДокументов.Заказ ЕСТЬ NULL
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РеализацияТоваровУслуг.Ссылка,
	|		ЛОЖЬ,
	|		СтатусыЗаказов.Период
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаказов КАК СтатусыЗаказов
	|			ПО (РеализацияТоваровУслуг.Дата >= &Период)
	|				И (РеализацияТоваровУслуг.ВладелецТовара = &Партнер)
	|				И (РеализацияТоваровУслуг.ТипОплаты = 4)
	|				И (РеализацияТоваровУслуг.ТерминалДоставки = &ТерминалДоставки)
	|				И РеализацияТоваровУслуг.Ссылка = СтатусыЗаказов.Заказ
	|				И (СтатусыЗаказов.Статус В (301, 302))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДвиженияПриложенныхДокументов КАК СтатусыДвиженияПриложенныхДокументов
	|			ПО РеализацияТоваровУслуг.Ссылка = СтатусыДвиженияПриложенныхДокументов.Заказ
	|				И (СтатусыДвиженияПриложенныхДокументов.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыДвиженияПриложенныхДокументов.ДокументыВозвращеныПартнеру))
	|	ГДЕ
	|		СтатусыДвиженияПриложенныхДокументов.Заказ ЕСТЬ NULL) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Заказы.Заказ КАК Заказ,
	|	РеализацияТоваровУслуг.ТерминалДоставки КАК ТерминалДоставки,
	|	ВЫБОР
	|		КОГДА ВТ_Заказы.СопроводительныеДокументы
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыПриложенныхДокументов.СопроводительныеДокументы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыПриложенныхДокументов.БезналичныеДокументы)
	|	КОНЕЦ КАК ВидПриложенногоДокумента,
	|	НЕ СтатусыДвиженияПриложенныхДокументов.Заказ ЕСТЬ NULL КАК ДокументПринятКассиром,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТ_Заказы.Период, ДЕНЬ), &НачПериода, ДЕНЬ) КАК ДнейВозврата,
	|	СтатусЗаказаИнтернетМагазина.Ссылка КАК СостояниеЗаказа
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатусЗаказаИнтернетМагазина КАК СтатусЗаказаИнтернетМагазина
	|			ПО РеализацияТоваровУслуг.СтатусИнтернетМагазина = СтатусЗаказаИнтернетМагазина.Код
	|		ПО ВТ_Заказы.Заказ = РеализацияТоваровУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДвиженияПриложенныхДокументов КАК СтатусыДвиженияПриложенныхДокументов
	|		ПО ВТ_Заказы.Заказ = СтатусыДвиженияПриложенныхДокументов.Заказ
	|			И (СтатусыДвиженияПриложенныхДокументов.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыДвиженияПриложенныхДокументов.ДокументыВозвращеныВТК))";
	
	Объект.Заказы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСканирования()
	
	ТаблицаСканирования.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказы", Объект.Заказы.Выгрузить(, "Заказ").ВыгрузитьКолонку("Заказ"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В (&Заказы)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаСканирования = ТаблицаСканирования.Добавить();
		СтрокаСканирования.Заказ = Выборка.Заказ;
		СтрокаСканирования.Штрихкод = СокрЛП(Выборка.Номер);
		СтрокаСканирования = ТаблицаСканирования.Добавить();
		СтрокаСканирования.Заказ = Выборка.Заказ;
		СтрокаСканирования.Штрихкод = СокрЛП(Выборка.НомерВнешнегоЗаказа);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СканироватьШКНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СканироватьШКЗавершение", ЭтаФорма);
	ПоказатьВводСтроки(ОписаниеОповещения,,"Введите ШК",,);
	
КонецПроцедуры


&НаКлиенте
Процедура СканироватьШКЗавершение(Штрихкод, ДопПараметры) Экспорт
	
	Если Штрихкод = Неопределено Или ПустаяСтрока(Штрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	СканироватьШКНаСервере(Штрихкод);
	
КонецПроцедуры

&НаСервере
Процедура СканироватьШКНаСервере(Штрихкод)
	
	Если ТолькоПросмотр Тогда
		Сообщить("Наборная ведомость на этапе обработки. Сканирование запрещено!");
		Возврат;
	КонецЕсли;
	
	ИсходныйШтрихкод = СокрЛП(Штрихкод);
	
	Если Объект.Партнер = Справочники.Контрагенты.НайтиПоКоду("Shop_976") Тогда
		ИскомыйШтрихкод = Прав(ИсходныйШтрихкод, 8);
	Иначе
		ИскомыйШтрихкод = ИсходныйШтрихкод;
	КонецЕсли;
	
	СтрокиСканирования = ТаблицаСканирования.НайтиСтроки(Новый Структура("Штрихкод", ИскомыйШтрихкод));
	Если СтрокиСканирования.Количество() Тогда
		
		СтрокаСканирования = СтрокиСканирования[0];
		СтрокиЗаказа = Объект.Заказы.НайтиСтроки(Новый Структура("Заказ", СтрокаСканирования.Заказ));
		Если СтрокиЗаказа.Количество() Тогда
			СтрокаЗаказа = СтрокиЗаказа[0];
			СтрокаЗаказа.Штрихкод = ИсходныйШтрихкод;
			СтрокаЗаказа.ЗаказПодтвержденКСборке = Истина;
			
			Модифицированность = Истина;
			
			Элементы.Заказы.ТекущаяСтрока = Объект.Заказы.Индекс(СтрокаЗаказа);
			
			Попытка
				Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
				Если Не Объект.Ссылка.Пустая() Тогда
					ПроверитьЭтапОбработки();
					
					Если ТолькоПросмотр Тогда
						Сообщить("Наборная ведомость на этапе обработки. Сканирование запрещено!");
						Возврат;
					КонецЕсли;
				КонецЕсли;
			КонецПопытки;
		Иначе
			Сообщить("Заказ " + СокрП(ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаСканирования.Заказ, "Номер")) + " не найден!");
		КонецЕсли;
		
	Иначе
		Сообщить("ШК " + ИсходныйШтрихкод + " не найден!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПечатьВозвратнаяНакладнаяНаСервере()
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Документы.НаборнаяВедомостьВозвратаПриложенныхДокументов.ПолучитьМакет("ВозвратнаяНакладная");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	Контрагенты.ОсновнойДоговорКонтрагента.Организация.Наименование КАК ОрганизацияНаименование,
	|	Контрагенты.ОсновнойДоговорКонтрагента.Номер КАК НомерДоговора,
	|	Контрагенты.ОсновнойДоговорКонтрагента.Дата КАК ДатаДоговора
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборнаяВедомостьВозвратаПриложенныхДокументовЗаказы.Заказ.Номер КАК НомерЗаказа,
	|	НаборнаяВедомостьВозвратаПриложенныхДокументовЗаказы.Заказ.НомерВнешнегоЗаказа КАК ВнешнийНомерЗаказа
	|ИЗ
	|	Документ.НаборнаяВедомостьВозвратаПриложенныхДокументов.Заказы КАК НаборнаяВедомостьВозвратаПриложенныхДокументовЗаказы
	|ГДЕ
	|	НаборнаяВедомостьВозвратаПриложенныхДокументовЗаказы.Ссылка = &Ссылка
	|	И НаборнаяВедомостьВозвратаПриложенныхДокументовЗаказы.ЗаказПодтвержденКСборке
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаказа";
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатПакета[0].Выбрать();
	Выборка.Следующий();
	
	Область = Макет.ПолучитьОбласть("Шапка");
	ПараметрыОбласти = Область.Параметры;
	
	ПараметрыОбласти.НомерНаборной = Объект.Номер;
	ПараметрыОбласти.НомерВозврата = Объект.Номер;
	ПараметрыОбласти.ДатаСоставления = Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
	
	ПараметрыОбласти.ДатаВозврата = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	ПараметрыОбласти.Договор = "Договор № " + Выборка.НомерДоговора + " от " + Формат(Выборка.ДатаДоговора, "ДФ=dd.MM.yyyy");
	
	ЮрАдрес    = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Объект.Партнер, "Юридический");	
	ТекстГрузополучатель = "" + Выборка.НаименованиеПолное + ", ИНН" + Выборка.ИНН  + ", " + Выборка.КПП + ", " + ЮрАдрес;
	
	ПараметрыОбласти.Грузополучатель = ТекстГрузополучатель;
	ПараметрыОбласти.Грузоотправитель = Выборка.ОрганизацияНаименование;
	
	ТабДок.Вывести(Область);
	
	Выборка = РезультатПакета[1].Выбрать();
	
	Область = Макет.ПолучитьОбласть("Строка");
	ПараметрыОбласти = Область.Параметры;
	
	НПП = 0;
	Пока Выборка.Следующий() Цикл
		НПП = НПП + 1;
		ПараметрыОбласти.НПП = НПП;
		ПараметрыОбласти.НомерЗаказа = СокрЛП(Выборка.НомерЗаказа);
		ПараметрыОбласти.ВнешнийНомерЗаказа = СокрЛП(Выборка.ВнешнийНомерЗаказа);
		ТабДок.Вывести(Область);
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("СтрокаИтогПоЗаказу");
	ПараметрыОбласти = Область.Параметры;
	ПараметрыОбласти.КоличествоПоЗаказу = НПП;
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("СтрокаИтогиОбщие");
	ПараметрыОбласти = Область.Параметры;
	ПараметрыОбласти.КоличествоОбщее = НПП;
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Подвал");
	ПараметрыОбласти = Область.Параметры;
	ПараметрыОбласти.ИтогиПрописью = "Всего количество переданных комплектов составило " + НПП + " (" + СокрП(ФормированиеПечатныхФорм.КоличествоПрописью(НПП)) + ").";
	ТабДок.Вывести(Область);
	
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.КоличествоЭкземпляров = 2;
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура ПечатьВозвратнаяНакладная(Команда)
	ТабДок = ПечатьВозвратнаяНакладнаяНаСервере();
	ТабДок.Показать();
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПредлагатьУстановкуСтатусаПриПроведении(Знач Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.ЭтапыВозвратаСопроводительныхДокументов КАК ЭтапыВозвратаСопроводительныхДокументов
	|ГДЕ
	|	ЭтапыВозвратаСопроводительныхДокументов.ВозвратСопроводительныхДокументов = &Ссылка";

	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПопыткаЗакрытияОкна = Ложь;
	Если Объект.Проведен Тогда
		Если ПредлагатьУстановкуСтатусаПриПроведении(Объект.Ссылка) Тогда
			БлокироватьЗакрытиеОкна = Истина;
			ПоказатьВопрос(Новый ОписаниеОповещения("ВопросУстановкаСтатусаЗавершение", ЭтотОбъект), "Установить статус этапа обработки Подготовлен к возврату?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		ОповеститьОЗаписиНового(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСтатусПодготовленКВозврату(Знач НаборнаяВедомость)

	ЗаписьРегистра = РегистрыСведений.ЭтапыВозвратаСопроводительныхДокументов.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Период = ТекущаяДата();
	ЗаписьРегистра.ВозвратСопроводительныхДокументов = НаборнаяВедомость;
	ЗаписьРегистра.СтатусСкладскогоУчета = Справочники.СтатусыСкладскогоУчета.ПодготовленКВозврату;
	ЗаписьРегистра.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ЗаписьРегистра.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУстановкаСтатусаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УстановитьСтатусПодготовленКВозврату(Объект.Ссылка);
		Если Не ПопыткаЗакрытияОкна Тогда
			ПроверитьЭтапОбработки();
		КонецЕсли;
	КонецЕсли;
	БлокироватьЗакрытиеОкна = Ложь;
	Если ПопыткаЗакрытияОкна Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
		ПопыткаЗакрытияОкна = Истина;
		Отказ = БлокироватьЗакрытиеОкна;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыделитьВсеЗаказыНаСервере()
	
	Модифицированность = Истина;
	
	Для Каждого СтрокаЗаказа Из Объект.Заказы Цикл
		СтрокаЗаказа.ЗаказПодтвержденКСборке = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсеЗаказы(Команда)
	ВыделитьВсеЗаказыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СнятьВыделениеЗаказовНаСервере()
	
	Модифицированность = Истина;
	
	Для Каждого СтрокаЗаказа Из Объект.Заказы Цикл
		СтрокаЗаказа.ЗаказПодтвержденКСборке = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделениеЗаказов(Команда)
	СнятьВыделениеЗаказовНаСервере();
КонецПроцедуры
